ajruiz2000/HEART_RATE_STANDALONE/STM32_WPAN/App/app_ble.c
  UNUSED(ext_data);

  if (data[0] == HCI_EVENT_PKT_TYPE)
  {
    APP_BLE_ResumeFlowProcessCb.Callback = BLE_ResumeFlowProcessCallback;
    if (AMM_Alloc (CFG_AMM_VIRTUAL_APP_BLE,
                   DIVC((sizeof(BleEvtPacketHeader_t) + total_length), sizeof (uint32_t)),
                   (uint32_t **)&phcievt,
                   &APP_BLE_ResumeFlowProcessCb) != AMM_ERROR_OK)
    {
      APP_DBG_MSG("Alloc failed\n");
      status = BLE_STATUS_FAILED;
    }
    else if (phcievt != (BleEvtPacket_t *)0 )
    {
      phcievt->evtserial.type = HCI_EVENT_PKT_TYPE;
      phcievt->evtserial.evt.evtcode = data[1];
      phcievt->evtserial.evt.plen  = data[2];
      memcpy( (void*)&phcievt->evtserial.evt.payload, &data[3], data[2]);
      LST_insert_tail(&BleAsynchEventQueue, (tListNode *)phcievt);
      status = BLE_STATUS_SUCCESS;
      /* FREERTOS_MARK */
      osSemaphoreRelease(HCI_ASYNCH_EVT_Thread_SemHandle);
    }
  }
  else if (data[0] == HCI_ACLDATA_PKT_TYPE)
  {
    status = BLE_STATUS_SUCCESS;
  }
  return status;
}

/* FREERTOS_MARK */
void BleStack_Process_BG_Entry(void* thread_input)
{
  (void)(thread_input);

  while(1)
  {
    osSemaphoreAcquire(BLE_HOST_Thread_SemHandle, osWaitForever);
    BleStack_Process_BG();
  }
}

void Ble_UserEvtRx_Entry(void* thread_input)
{
  (void)(thread_input);

  while(1)
  {
    osSemaphoreAcquire(HCI_ASYNCH_EVT_Thread_SemHandle, osWaitForever);
    /* FREERTOS_MARK */
    osMutexAcquire(LINK_LAYER_Thread_MutexHandle, osWaitForever);
    Ble_UserEvtRx();
    /* FREERTOS_MARK */
    osMutexRelease(LINK_LAYER_Thread_MutexHandle);
  }
}

void APP_BLE_AdvLowPower_Entry(void* thread_input)
{
  (void)(thread_input);

  while(1)
  {
    osSemaphoreAcquire(ADV_LP_REQ_Thread_SemHandle, osWaitForever);
    /* FREERTOS_MARK */
    osMutexAcquire(LINK_LAYER_Thread_MutexHandle, osWaitForever);
    HAL_GPIO_WritePin(LD3_GPIO_Port, LD3_Pin, GPIO_PIN_SET);
    HAL_GPIO_WritePin(LD2_GPIO_Port, LD2_Pin, GPIO_PIN_RESET);
    APP_BLE_AdvLowPower();
    /* FREERTOS_MARK */
    osMutexRelease(LINK_LAYER_Thread_MutexHandle);
  }
}

void HRS_APP_Measurements_Entry(void* thread_input)
{
  (void)(thread_input);

  while(1)
  {
    osSemaphoreAcquire(MEAS_REQ_Thread_SemHandle, osWaitForever);
    HAL_GPIO_WritePin(LD1_GPIO_Port, LD1_Pin, GPIO_PIN_RESET);
    /* FREERTOS_MARK */
    HRS_APP_Measurements();
    HAL_GPIO_WritePin(LD1_GPIO_Port, LD1_Pin, GPIO_PIN_SET);
  }
}

void NVMCB_Store( const uint32_t* ptr, uint32_t size )
{
  UNUSED(ptr);
  UNUSED(size);

  /* Call SNVMA for storing - Without callback */
  SNVMA_Write (APP_BLE_NvmBuffer,
               BLE_NvmCallback);
}
/* USER CODE BEGIN FD_WRAP_FUNCTIONS */

/* USER CODE END FD_WRAP_FUNCTIONS */
